tukano-artillery-tests/logs/users-nosql-33.txt
--------------------------------
Summary report @ 12:40:24(+0000)
--------------------------------

http.codes.200: ................................................................ 990
http.downloaded_bytes: ......................................................... 6824
http.request_rate: ............................................................. 33/sec
http.requests: ................................................................. 990
http.response_time:
  min: ......................................................................... 213
  max: ......................................................................... 768
  mean: ........................................................................ 258
  median: ...................................................................... 247.2
  p95: ......................................................................... 295.9
  p99: ......................................................................... 608
http.response_time.2xx:
  min: ......................................................................... 213
  max: ......................................................................... 768
  mean: ........................................................................ 258
  median: ...................................................................... 247.2
  p95: ......................................................................... 295.9
  p99: ......................................................................... 608
http.responses: ................................................................ 990
plugins.metrics-by-endpoint./rest/users/.codes.200: ............................ 990
plugins.metrics-by-endpoint.response_time./rest/users/:
  min: ......................................................................... 213
  max: ......................................................................... 768
  mean: ........................................................................ 258
  median: ...................................................................... 247.2
  p95: ......................................................................... 295.9
  p99: ......................................................................... 608
vusers.completed: .............................................................. 990
vusers.created: ................................................................ 990
vusers.created_by_name.DB Storage: ............................................. 990
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 656.4
  max: ......................................................................... 1256.4
  mean: ........................................................................ 728
  median: ...................................................................... 699.4
  p95: ......................................................................... 944
  p99: ......................................................................... 1130.2