tukano-artillery-tests/logs/users-nosql-5.txt
--------------------------------
Summary report @ 12:06:16(+0000)
--------------------------------

http.codes.200: ................................................................ 150
http.downloaded_bytes: ......................................................... 944
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 150
http.response_time:
  min: ......................................................................... 226
  max: ......................................................................... 443
  mean: ........................................................................ 247.4
  median: ...................................................................... 242.3
  p95: ......................................................................... 267.8
  p99: ......................................................................... 361.5
http.response_time.2xx:
  min: ......................................................................... 226
  max: ......................................................................... 443
  mean: ........................................................................ 247.4
  median: ...................................................................... 242.3
  p95: ......................................................................... 267.8
  p99: ......................................................................... 361.5
http.responses: ................................................................ 150
plugins.metrics-by-endpoint./rest/users/.codes.200: ............................ 150
plugins.metrics-by-endpoint.response_time./rest/users/:
  min: ......................................................................... 226
  max: ......................................................................... 443
  mean: ........................................................................ 247.4
  median: ...................................................................... 242.3
  p95: ......................................................................... 267.8
  p99: ......................................................................... 361.5
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.DB Storage: ............................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 658.3
  max: ......................................................................... 1101.2
  mean: ........................................................................ 715.9
  median: ...................................................................... 699.4
  p95: ......................................................................... 889.1
  p99: ......................................................................... 925.4