tukano-artillery-tests/logs/users-postgres-15.txt
--------------------------------
Summary report @ 16:32:00(+0000)
--------------------------------

http.codes.200: ................................................................ 450
http.downloaded_bytes: ......................................................... 3044
http.request_rate: ............................................................. 16/sec
http.requests: ................................................................. 450
http.response_time:
  min: ......................................................................... 121
  max: ......................................................................... 1595
  mean: ........................................................................ 309.6
  median: ...................................................................... 247.2
  p95: ......................................................................... 539.2
  p99: ......................................................................... 944
http.response_time.2xx:
  min: ......................................................................... 121
  max: ......................................................................... 1595
  mean: ........................................................................ 309.6
  median: ...................................................................... 247.2
  p95: ......................................................................... 539.2
  p99: ......................................................................... 944
http.responses: ................................................................ 450
plugins.metrics-by-endpoint./rest/users/.codes.200: ............................ 450
plugins.metrics-by-endpoint.response_time./rest/users/:
  min: ......................................................................... 121
  max: ......................................................................... 1595
  mean: ........................................................................ 309.6
  median: ...................................................................... 247.2
  p95: ......................................................................... 539.2
  p99: ......................................................................... 944
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.DB Storage: ............................................. 450
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 643.1
  max: ......................................................................... 5972.3
  mean: ........................................................................ 1282.9
  median: ...................................................................... 727.9
  p95: ......................................................................... 4583.6
  p99: ......................................................................... 5598.4