tukano-artillery-tests/logs/users-postgres-33.txt
--------------------------------
Summary report @ 17:22:17(+0000)
--------------------------------

http.codes.200: ................................................................ 990
http.downloaded_bytes: ......................................................... 6824
http.request_rate: ............................................................. 32/sec
http.requests: ................................................................. 990
http.response_time:
  min: ......................................................................... 83
  max: ......................................................................... 3379
  mean: ........................................................................ 663.5
  median: ...................................................................... 518.1
  p95: ......................................................................... 1720.2
  p99: ......................................................................... 2416.8
http.response_time.2xx:
  min: ......................................................................... 83
  max: ......................................................................... 3379
  mean: ........................................................................ 663.5
  median: ...................................................................... 518.1
  p95: ......................................................................... 1720.2
  p99: ......................................................................... 2416.8
http.responses: ................................................................ 990
plugins.metrics-by-endpoint./rest/users/.codes.200: ............................ 990
plugins.metrics-by-endpoint.response_time./rest/users/:
  min: ......................................................................... 83
  max: ......................................................................... 3379
  mean: ........................................................................ 663.5
  median: ...................................................................... 518.1
  p95: ......................................................................... 1720.2
  p99: ......................................................................... 2416.8
vusers.completed: .............................................................. 990
vusers.created: ................................................................ 990
vusers.created_by_name.DB Storage: ............................................. 990
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 640.9
  max: ......................................................................... 7847
  mean: ........................................................................ 2309
  median: ...................................................................... 1465.9
  p95: ......................................................................... 5598.4
  p99: ......................................................................... 5944.6