tukano-artillery-tests/logs/users-postgres-5.txt
--------------------------------
Summary report @ 14:22:58(+0000)
--------------------------------

http.codes.200: ................................................................ 150
http.downloaded_bytes: ......................................................... 944
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 150
http.response_time:
  min: ......................................................................... 230
  max: ......................................................................... 876
  mean: ........................................................................ 299.2
  median: ...................................................................... 257.3
  p95: ......................................................................... 383.8
  p99: ......................................................................... 507.8
http.response_time.2xx:
  min: ......................................................................... 230
  max: ......................................................................... 876
  mean: ........................................................................ 299.2
  median: ...................................................................... 257.3
  p95: ......................................................................... 383.8
  p99: ......................................................................... 507.8
http.responses: ................................................................ 150
plugins.metrics-by-endpoint./rest/users/.codes.200: ............................ 150
plugins.metrics-by-endpoint.response_time./rest/users/:
  min: ......................................................................... 230
  max: ......................................................................... 876
  mean: ........................................................................ 299.2
  median: ...................................................................... 257.3
  p95: ......................................................................... 383.8
  p99: ......................................................................... 507.8
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.DB Storage: ............................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 658.3
  max: ......................................................................... 1436.7
  mean: ........................................................................ 770.5
  median: ...................................................................... 742.6
  p95: ......................................................................... 982.6
  p99: ......................................................................... 1064.4